docs/_posts/2020-04-03-emacs-configuration.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org09b904e">1. Installation</a>
<ul>
<li><a href="#org9b6bca7">1.1. Clone</a></li>
<li><a href="#org74837d9">1.2. Install Emacs</a>
<ul>
<li><a href="#org6513a23">1.2.1. MacOS</a></li>
<li><a href="#org5a5dfc7">1.2.2. Ubuntu</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc3dec34">2. Docker</a></li>
<li><a href="#orge45df5e">3. Dependencies</a>
<ul>
<li><a href="#orgd197b37">3.1. The Silver Searcher (ag)</a></li>
<li><a href="#org1495eb7">3.2. Fish shell</a></li>
<li><a href="#orgc8bcffd">3.3. LSP</a>
<ul>
<li><a href="#org81fb425">3.3.1. ccls</a>
<ul>
<li><a href="#org326048f">3.3.1.1. MacOS</a></li>
<li><a href="#org967a55f">3.3.1.2. Linux</a></li>
</ul>
</li>
<li><a href="#org92a5d3f">3.3.2. lsp-python-ms</a></li>
<li><a href="#orga5ee324">3.3.3. rust-analyzer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
---
layout: default
title: Emacs Configuration
excerpt: My personal emacs configuration.
---
<p>
This page is for setting up my emacs configuration.
</p>

<div id="outline-container-org09b904e" class="outline-2">
<h2 id="org09b904e"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9b6bca7" class="outline-3">
<h3 id="org9b6bca7"><span class="section-number-3">1.1</span> Clone</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Clone this repository to your $HOME folder.
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/markrepedersen/emacs-configuration.git ~/.emacs.d/~
</pre>
</div>
</div>
</div>

<div id="outline-container-org74837d9" class="outline-3">
<h3 id="org74837d9"><span class="section-number-3">1.2</span> Install Emacs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Obviously, Emacs must be installed using your package manager of choice.
</p>
</div>

<div id="outline-container-org6513a23" class="outline-4">
<h4 id="org6513a23"><span class="section-number-4">1.2.1</span> MacOS</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Emacs comes with MacOS out of the box, however, its version is quite old. I'd recommend either upgrading the built-in one or using Homebrew to install a new one.
</p>

<p>
Here's what I use: 
</p>

<div class="org-src-container">
<pre class="src src-bash">brew install emacs-head --HEAD --with-cocoa --with-mailutils --with-jansson --with-crash-debug --with-retro-icon-gnu-head
ln -s /usr/local/opt/emacs-head/Emacs.app /Applications
alias emacs="/usr/local/Cellar/emacs-head/HEAD-e6c6486_1/bin/emacs -nw"
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a5dfc7" class="outline-4">
<h4 id="org5a5dfc7"><span class="section-number-4">1.2.2</span> Ubuntu</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-bash">sudo add-apt-repository ppa:ubuntu-elisp/ppa
sudo apt-get update
sudo apt-get install emacs-snapshot
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3dec34" class="outline-2">
<h2 id="orgc3dec34"><span class="section-number-2">2</span> Docker</h2>
<div class="outline-text-2" id="text-2">
<p>
To ensure reliable builds, it's nice to compile/run code on a standardized machine. Docker is good for this.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Publish image to Docker Hub.</li>
</ul>

<p>
To build the image: 
</p>

<div class="org-src-container">
<pre class="src src-bash">DOCKER_BUILDKIT=1 docker build -t emacs:latest .
</pre>
</div>

<p>
To run the image:
</p>
<div class="org-src-container">
<pre class="src src-bash">docker run -it emacs:latest bash
</pre>
</div>
</div>
</div>

<div id="outline-container-orge45df5e" class="outline-2">
<h2 id="orge45df5e"><span class="section-number-2">3</span> Dependencies</h2>
<div class="outline-text-2" id="text-3">
<p>
The following dependencies will have to be installed on your system. 
On MacOS, Emacs doesn't share your session's PATH variable. See `lisp/exec-path-from-shell-init.el` for how this is handled.
</p>
</div>

<div id="outline-container-orgd197b37" class="outline-3">
<h3 id="orgd197b37"><span class="section-number-3">3.1</span> The Silver Searcher (ag)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Follow the installation instructions here: 
<a href="https://github.com/ggreer/the_silver_searcher">https://github.com/ggreer/the_silver_searcher</a>
</p>
</div>
</div>

<div id="outline-container-org1495eb7" class="outline-3">
<h3 id="org1495eb7"><span class="section-number-3">3.2</span> Fish shell</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Follow the installation instructions here: 
<a href="https://github.com/fish-shell/fish-shell">https://github.com/fish-shell/fish-shell</a>
</p>
</div>
</div>

<div id="outline-container-orgc8bcffd" class="outline-3">
<h3 id="orgc8bcffd"><span class="section-number-3">3.3</span> LSP</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This makes Emacs into a full-blown IDE. The following language servers must be installed for C/C++/Rust/Python to work. 
All other languages will have their respective servers automatically installed.
</p>
</div>
<div id="outline-container-org81fb425" class="outline-4">
<h4 id="org81fb425"><span class="section-number-4">3.3.1</span> ccls</h4>
<div class="outline-text-4" id="text-3-3-1">
</div>
<div id="outline-container-org326048f" class="outline-5">
<h5 id="org326048f"><span class="section-number-5">3.3.1.1</span> MacOS</h5>
<div class="outline-text-5" id="text-3-3-1-1">
<div class="org-src-container">
<pre class="src src-bash">brew install ccls
</pre>
</div>
</div>
</div>

<div id="outline-container-org967a55f" class="outline-5">
<h5 id="org967a55f"><span class="section-number-5">3.3.1.2</span> Linux</h5>
<div class="outline-text-5" id="text-3-3-1-2">
<p>
See <a href="https://snapcraft.io/ccls">https://snapcraft.io/ccls</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org92a5d3f" class="outline-4">
<h4 id="org92a5d3f"><span class="section-number-4">3.3.2</span> lsp-python-ms</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Follow the installation instructions here: 
<a href="https://github.com/emacs-lsp/lsp-python-ms">https://github.com/emacs-lsp/lsp-python-ms</a>
</p>
</div>
</div>

<div id="outline-container-orga5ee324" class="outline-4">
<h4 id="orga5ee324"><span class="section-number-4">3.3.3</span> rust-analyzer</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
See <a href="https://rust-analyzer.github.io/manual.html#installation">https://rust-analyzer.github.io/manual.html#installation</a> for installation instructions.
</p>
</div>
</div>
</div>
</div>
